Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM1216PL10048.svd
            <register>
               <name>CHINTFLAG</name>
               <description>Channel Interrupt Flag Status and Clear</description>
               <addressOffset>0x4E</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>TERR</name>
                     <description>Transfer Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Transfer Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Suspend</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHSTATUS</name>
               <description>Channel Status</description>
               <addressOffset>0x4F</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PEND</name>
                     <description>Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Fetch Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DSU</name>
         <version>06333v1</version>
         <description>Device Service Unit</description>
         <baseAddress>0x41002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>DCCDMALVL0</name>
                     <description>DMA Trigger 0 Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DCCDMALVL0Select</name>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Trigger n rises when DCCn is read and falls when it is written</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>Trigger n rises when DCCn is written and falls when it is read</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCCDMALVL1</name>
                     <description>DMA Trigger 1 Level</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DCCDMALVL1Select</name>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Trigger n rises when DCCn is read and falls when it is written</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>Trigger n rises when DCCn is written and falls when it is read</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QOS</name>
                     <description>DSU QoS Level</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPCTRL</name>
               <description>Write Protection Control</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPLCK</name>
                     <description>Write Protection Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Allow writes to the WPCTRL register</description>
                           <value>0x445355</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLC</name>
               <description>Control C</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>DBGRW0</name>
                     <description>CPU0 Debug R/W</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status A</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Done Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSTEXT0</name>
                     <description>CPU0 Reset Extension Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BREXT0</name>
                     <description>Boot ROM 0 Phase Extension Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Status B</description>
               <addressOffset>0x108</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BCCD0</name>
                     <description>Boot ROM Communication Channel 0 Dirty</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCCD1</name>
                     <description>Boot ROM Communication Channel 1 Dirty</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCCD0</name>
                     <description>Debug Communication Channel 0 Dirty</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCCD1</name>
                     <description>Debug Communication Channel 1 Dirty</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGPRES</name>
                     <description>Debugger Present Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPS</name>
                     <description>Hot-plugging Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>BCC[%s]</name>
               <description>Boot ROM Channel #</description>
               <addressOffset>0x110</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>DCC[%s]</name>
               <description>Debug Communication Channel #</description>
               <addressOffset>0x118</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DID</name>
               <description>Device Identification</description>
               <addressOffset>0x120</addressOffset>
               <access>read-only</access>
               <resetValue>0x0BA0C053</resetValue>
               <fields>
                  <field>
                     <name>FV</name>
                     <description>Fixed Value of 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MANID</name>
                     <description>JEDEC Manufacture ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>PNDID</name>
                     <description>Part Number Device ID</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PNMID</name>
                     <description>Part Number Mask ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VER</name>
                     <description>Version Code</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAL</name>
               <description>Debugger Access Level</description>
               <addressOffset>0x124</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CPU0</name>
                     <description>CPU 0 Debugger Access Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CPU0Select</name>
                        <enumeratedValue>
                           <name>SECURED</name>
                           <description>The Debugger targeting the CPU0 domain can only access the DSU external address space; otherwise, debugger access is disabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL_DEBUG</name>
                           <description>The Debugger has unrestricted access</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY0</name>
               <description>CoreSight ROM Table Entry 0</description>
               <addressOffset>0x1000</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY1</name>
               <description>CoreSight ROM Table Entry 1</description>
               <addressOffset>0x1004</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY2</name>
               <description>CoreSight ROM Table Entry 2</description>
               <addressOffset>0x1008</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY3</name>
               <description>CoreSight ROM Table Entry 3</description>
               <addressOffset>0x100C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>CoreSight Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>CoreSight Rom Table Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>CoreSight ROM Table Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEMTYPE</name>
               <description>CoreSight ROM Table Memory Type</description>
               <addressOffset>0x1FCC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SYSMEM</name>
                     <description>CoreSight System Memory Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID4</name>
               <description>CoreSight Peripheral Identification 4</description>
               <addressOffset>0x1FD0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES2</name>
                     <description>CoreSight JEP-106 Continuation Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>CoreSight Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID5</name>
               <description>CoreSight Peripheral Identification 5</description>
               <addressOffset>0x1FD4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID6</name>
               <description>CoreSight Peripheral Identification 6</description>
               <addressOffset>0x1FD8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID7</name>
               <description>CoreSight Peripheral Identification 7</description>
               <addressOffset>0x1FDC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>CoreSight Reserved Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID0</name>
               <description>CoreSight Peripheral Identification 0</description>
               <addressOffset>0x1FE0</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000D0</resetValue>
               <fields>
                  <field>
                     <name>PART0</name>
                     <description>CoreSight Part Number Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
