Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM1216PL10048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SYSCTRL</name>
         <version>06261v1-rc12</version>
         <description>System Controller</description>
         <baseAddress>0x42002C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>BOOTCTRL</name>
               <description>Boot Control</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>SYSINIT</name>
                     <description>System Initialization Ongoing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BREXTEN</name>
                     <description>BREXT Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCEPARK</name>
                     <description>Force Park Mode Entry</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USERCFG</name>
               <description>User Configuration</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>CRCSEL</name>
                     <description>CRC Polynomial Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CRCSELSelect</name>
                        <enumeratedValue>
                           <name>CRC16</name>
                           <description>CRC-16-CCITT</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC32</name>
                           <description>CRC-32 (IEEE 802.3)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCBOOT</name>
                     <description>CRC Boot</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUT</name>
                     <description>Start-up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SUTSelect</name>
                        <enumeratedValue>
                           <name>0MS</name>
                           <description>0 ms</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1MS</name>
                           <description>1 ms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2MS</name>
                           <description>2 ms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MS</name>
                           <description>4 ms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MS</name>
                           <description>8 ms</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16MS</name>
                           <description>16 ms</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32MS</name>
                           <description>32 ms</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64MS</name>
                           <description>64 ms</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPSENSE</name>
               <description>Temperature Sensor Calibration</description>
               <addressOffset>0x88</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEMPSENSE0</name>
                     <description>Temperature Sensor Calibration Slope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TEMPSENSE1</name>
                     <description>Temperature Sensor Calibration Offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
