Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM1216PL10048.svd
               <register>
                  <name>CTRLBCLR</name>
                  <description>Control B Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LUPD</name>
                        <description>Lock Update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-Shot on Counter</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLBSET</name>
                  <description>Control B Set</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LUPD</name>
                        <description>Lock Update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-Shot on Counter</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Force a start, restart or retrigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STOP</name>
                              <description>Force a stop</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDATE</name>
                              <description>Force update of double buffered registers</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READSYNC</name>
                              <description>Force a read synchronization of COUNT</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DMAOS</name>
                              <description>One-shot DMA trigger</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EVCTRL</name>
                  <description>Event Control</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>EVACT</name>
                        <description>Event Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EVACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Event action disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Start, restart or retrigger TC on event</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT</name>
                              <description>Count on event</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>START</name>
                              <description>Start TC on event</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STAMP</name>
                              <description>Time stamp capture</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PPW</name>
                              <description>Period captured in CC0, pulse width in CC1</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWP</name>
                              <description>Period captured in CC1, pulse width in CC0</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PW</name>
                              <description>Pulse width capture</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TCINV</name>
                        <description>TC Inverted Event Input Polarity</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCEI</name>
                        <description>TC Event Input Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVFEO</name>
                        <description>Overflow/Underflow Event Output Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MCEO0</name>
                        <description>Match or Capture Channel 0 Event Output Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MCEO1</name>
                        <description>Match or Capture Channel 1 Event Output Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>Interrupt Enable Clear</description>
                  <addressOffset>0x8</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0 Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1 Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>Interrupt Enable Set</description>
                  <addressOffset>0x9</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0 Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1 Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>Interrupt Flag Status and Clear</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVF</name>
                        <description>Overflow Interrupt Flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERR</name>
                        <description>Error Interrupt Flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC0</name>
                        <description>Match or Capture Channel 0</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MC1</name>
                        <description>Match or Capture Channel 1</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>Status</description>
                  <addressOffset>0xB</addressOffset>
                  <size>8</size>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>STOP</name>
                        <description>Stop Status Flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLAVE</name>
                        <description>Client Status Flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PERBUFV</name>
                        <description>Period Buffer Valid</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CCBUFV0</name>
                        <description>Channel 0 Compare or Capture Buffer Valid</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CCBUFV1</name>
                        <description>Channel 1 Compare or Capture Buffer Valid</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WAVE</name>
                  <description>Waveform Generation Control</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>WAVEGEN</name>
                        <description>Waveform Generation Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>WAVEGENSelect</name>
                           <enumeratedValue>
                              <name>NFRQ</name>
                              <description>Normal Frequency Generation mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MFRQ</name>
                              <description>Match Frequency Generation mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NPWM</name>
                              <description>Normal Pulse-Width Modulation mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MPWM</name>
                              <description>Match Pulse-Width Modulation mode</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DRVCTRL</name>
                  <description>Driver Control</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>INVEN0</name>
                        <description>Waveform Output 0 Invert Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INVEN1</name>
                        <description>Waveform Output 1 Invert Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>Debug Control</description>
                  <addressOffset>0xF</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DBGRUN</name>
                        <description>Run in Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>SWRST Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>ENABLE Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STATUS</name>
                        <description>STATUS Synchronization Busy</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNT</name>
                        <description>COUNT Synchronization Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PER</name>
                        <description>PER Synchronization Busy</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC0</name>
                        <description>Compare/Capture Channel 0 Synchronization Busy</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC1</name>
                        <description>Compare/Capture Channel 1 Synchronization Busy</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>COUNT</name>
                  <description>COUNT32 Counter</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>COUNT</name>
                        <description>Counter Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>CC[%s]</name>
                  <description>COUNT32 Channel # Compare/Capture</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>CC</name>
                        <description>Channel Compare/Capture Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>CCBUF[%s]</name>
                  <description>COUNT32 Channel # Compare Buffer</description>
                  <addressOffset>0x30</addressOffset>
                  <fields>
                     <field>
                        <name>CCBUF</name>
                        <description>Channel Compare Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
